# შექმენით სია სადაც, შეიტანთ მინიმუმ 10 რიცხვს, გადაუარეთ for 
# ციკლის დახმარებით და დაბეჭდეთ თითოეული რიცხვი კენტია თუ ლუწი.

number = [1,2,3,4,5,6,7,8,9,10]

for i in number:
    if i % 2 == 0:
        print("ლუწია")
    else:
        print("კენტია")

#შექმენით სახელების სია სადაც გექნებათ მინიმუმ 10 სახელი, დაბეჭდეთ
#  ამ სიიდან მხოლოდ ის სახელები რომლების ინდექსებიც არის ლუწი

name = ["luka","sandro","givi","ana","nikolozi","niko","rezi","levani","saba","ikuna",]

for index in range(len(name)):
    if index % 2 == 0:
        print(name[index])


 #შექმენით სია სადაც გექნებათ 10 რიცხვი, თქვენი დავალებაა გაიგოთ
 #  ამ სიაში ყველა ლუწი და კენტი რიცხვიოს ჯამი და დაბეჭდოთ

number1 = [11,12,13,14,115,16,17,18,19,20]
 
for i in range(number1):
    