#1) კარგად დაუკვირდით შემდეგ კოდს და ახსენით თითოეული მოქმედება კომენტარებით:

def manual_range(end, start = 0, step = 1): #შევქმენით მენუალ ფუნქცია და შიგნით მოვათავსეთ სამი მნიშვნელობა ენდი სტარტი და სტეპი
#თავდაპირველად სტარტის მნიშვნელობა უდრის 0 ს და შემდეგ უკვე ჩვენს მიერ ჩაწერილ რიცხვს 
# ხოლო იგივეა სტეპზეც თავდაპირველად ის უდრის 1 ს
    while start <= end: #სანამ სტარტის მნიშვნელობა ნაკლებია ან ტოლია ენდის მნიშვნელობაზე დაბეჭდე სტარტი
        print(start)
        start += step  #ხოლო როდესაც ზემოთ ჩამოთვლილი შესრულდება დაამატე სტეპის მნიშვნელობა 
    
manual_range(10, 1, 2)