// 1) კომენტარებით ახსენით რა არის let და const keyword-ები, რა შემთხვევაში უნდა გამოვიყენოთ თითოეული მათგანი

// let გამოიყენება ცვლადებისთვის, რომელთა მნიშვნელობაც შეიძლება შეიცვალოს.
let age = 25;
age = 30;  //  ნებადართულია, რადგან let-ით გამოცხადებულ ცვლადს მნიშვნელობის შეცვლა შეუძლია.

// const გამოიყენება ცვლადებისთვის, რომლებიც არ უნდა შეიცვალოს.
const pi = 3.14;

// let შეგვიძლია გამოვაცხადოთ მნიშვნელობის გარეშე, ხოლო const აუცილებლად უნდა დავაინიციალიზოთ.
let name;  //  ნებადართულია
name = "Alice";

// const city;  //  შეცდომა: const ცვლადს გამოცხადებისას აუცილებლად უნდა ჰქონდეს მნიშვნელობა.


// 2) კომენტარებით ახსენით რატომ გამოიტანს ეს error-ს:

// let num = 5;
// let num = 10;  

let num = 5;
num = 10;  


// 3) ქულის მიხედვით შეფასების დაბეჭდვა
let score = 85;  

if (score >= 90 && score <= 100) {
    console.log("A");
} else if (score >= 80 && score <= 89) {
    console.log("B");
} else if (score >= 70 && score <= 79) {
    console.log("C");
} else if (score >= 60 && score <= 69) {
    console.log("D");
} else {
    console.log("F");
}

console.log(10 == "10"); 

console.log(10 === "10"); 
console.log(5 != 10); 

console.log(15 > 10); 

console.log(7 <= 7); 
