# 2) გამოიტანეთ თქვენი სახელი და გვარი იმდენჯერ, რამდენი წლისაც ხართ
age = 25  # მაგალითად, ასაკი 25
for _ in range(age):
    print("თქვენი სახელი და გვარი")  # თქვენი სახელი და გვარი

# 3) გამოიტანეთ ტერმინალში რიცხვები 1-დან 20-ის ჩათვლით
for i in range(1, 21):
    print(i)

# 4) გამოიტანეთ ტერმინალში რიცხვები 20-დან 0-მდე
for i in range(20, -1, -1):  # პირველი არგუმენტი 20, მეორე - 0 (გამორიცხულია), მესამე - -1 (ჩამოქვეითება)
    print(i)

# 5) გამოითვალეთ 1-დან 50-ის ჩათვლით ყველა რიცხვის ჯამი და დაპრინტეთ საბოლოო შედეგი
sum_numbers = 0
for i in range(1, 51):
    sum_numbers += i
print("1-დან 50-ის ჩათვლით რიცხვების ჯამი:", sum_numbers)

# 6) დაბეჭდეთ 1-დან 5-ის ჩათვლით რიცხვთა კვადრატი (n * n)
for i in range(1, 6):
    print(f"{i} კვადრატი არის {i * i}")

# 7) დაბეჭდეთ ყველა ლუწი რიცხვის ჯამი 1-დან 10-ის ჩათვლით
sum_even = 0
for i in range(1, 11):
    if i % 2 == 0:  # თუ რიცხვი ლუწია
        sum_even += i
print("1-დან 10-ის ჩათვლით ლუწი რიცხვების ჯამი:", sum_even)

# 8) მომხარებელს შემოატანინეთ რიცხვი და შეინახეთ ცვლადში, შემდეგ კი 0-დან შემოტანილი რიცხვის ჩათვლით შეამოწმეთ, თუ ლუწია
user_input = int(input("შეიყვანეთ რიცხვი: "))
if user_input % 2 == 0:
    print(user_input "არის ლუწი (is Even)")
else:
    print(user_input "არის კენტი (is Odd)")
