# პაროლი, რომელსაც შევინახავთ ცვლადში
password = "zura777"

# მცდელობების რაოდენობა
attempts = 3

while attempts > 0:
    # მომხმარებლის მიერ შეყვანილი პაროლი
    user_input = input("შეიყვანეთ პაროლი: ")
    
    if user_input == password:
        print("წვდომა მიღებულია")
        break  # თუ პაროლი სწორია, გამოვდივართ ციკლიდან
    else:
        attempts -= 1  # მცდელობა შემცირდება
        print("სცადეთ ხელახლა. დარჩენილი მცდელობები:", attempts)

# თუ მცდელობები ამოიწურა
if attempts == 0:
    print("მცდელობები ამოიწურა, გთხოვთ სცადოთ მოგვიანებით.")

    